# Требуется вычислить, сколько раз встречается некоторое число X
# в массиве A. Пользователь в первой строке вводит натуральное
# число N – количество элементов в массиве. В последующих  строках
# записаны N целых чисел Ai (можно использовать псевдогенерацию).
# Последняя строка содержит число X.

Numbers = abs(int(input('Введите количество элементов списка А: ')))
A_entered = input("Введите через пробел элементы списка: ").split()
A_num = list(map(int, A_entered))
if len(A_num) != Numbers:
    print('Введенные элементы не соответствуют заявленному количеству!')
else:
    X = int(input('Введите число X, которое необходимо найти в списке: '))
    count = 0
    for i in range(Numbers):
        if A_num[i] == X:
            count += 1
    print(f'Число {X} встречается в списке A {count} раз')
